Repository: nicolasestrem/mobility-trailblazers
Catalog: languages/mobility-trailblazers-*.po
Languages: de_de

source: Loading...
de_de: Wird geladen...

source: An error occurred. Please try again.
de_de: Ein Fehler ist aufgetreten. Bitte versuchen Sie es erneut.

source: Success!
de_de: Erfolg!

source: Saving...
de_de: Wird gespeichert...

source: Saved!
de_de: Gespeichert!

source: Are you sure you want to delete this?
de_de: Sind Sie sicher, dass Sie dies löschen möchten?

source: Submit
de_de: Absenden

source: Cancel
de_de: Abbrechen

source: Save
de_de: Speichern

source: Processing...
de_de: Wird verarbeitet...

source: Evaluation submitted successfully!
de_de: Bewertung erfolgreich eingereicht!

source: Draft saved successfully!
de_de: Entwurf erfolgreich gespeichert!

source: Evaluation saved successfully
de_de: Bewertung erfolgreich gespeichert

source: Evaluation deleted successfully
de_de: Bewertung erfolgreich gelöscht

source: Failed to delete evaluation
de_de: Bewertung konnte nicht gelöscht werden

source: Failed to save evaluation.
de_de: Bewertung konnte nicht gespeichert werden.

source: No evaluations could be processed.
de_de: Es konnten keine Bewertungen verarbeitet werden.

source: Unknown action: %s
de_de: Unbekannte Aktion: %s

source: EVALUATION COMPLETE
de_de: BEWERTUNG ABGESCHLOSSEN

source: All assignments finished!
de_de: Alle Aufgaben erledigt!

source: Congratulations!
de_de: Herzlichen Glückwunsch!

source: You have completed all evaluations!
de_de: Sie haben alle Bewertungen abgeschlossen!

source: Mission accomplished
de_de: Mission erfüllt

source: Congratulations! You have completed all evaluations!
de_de: Herzlichen Glückwunsch! Sie haben alle Bewertungen abgeschlossen!

source: Please rate all criteria before submitting.
de_de: Bitte bewerten Sie alle Kriterien vor dem Absenden.

source: Evaluate Candidate
de_de: Kandidat bewerten

source: Evaluation Criteria
de_de: Bewertungskriterien

source: Additional Comments
de_de: Zusätzliche Kommentare

source: Share your thoughts about this candidate's contributions to mobility innovation...
de_de: Teilen Sie Ihre Gedanken zu den Beiträgen dieses Kandidaten zur Mobilitätsinnovation...

source: Save as Draft
de_de: Als Entwurf speichern

source: Submit Evaluation
de_de: Bewertung abschließen

source: Evaluation Guidelines
de_de: Bewertungsrichtlinien

source: Score each criterion from 0 (lowest) to 10 (highest) based on your assessment
de_de: Bewerten Sie jedes Kriterium von 0 (niedrigste) bis 10 (höchste) basierend auf Ihrer Einschätzung

source: Consider the candidate's overall impact on mobility transformation
de_de: Berücksichtigen Sie die Gesamtwirkung des Kandidaten auf die Mobilitätstransformation

source: You can save your evaluation as a draft and return later to complete it
de_de: Sie können Ihre Bewertung als Entwurf speichern und später fortsetzen

source: Once submitted, you can still edit your evaluation if needed
de_de: Nach dem Einreichen können Sie Ihre Bewertung bei Bedarf noch bearbeiten

source: Total Score:
de_de: Gesamtpunktzahl:

source: characters
de_de: Zeichen

source: Welcome to Jury Dashboard
de_de: Willkommen im Jury-Dashboard

source: Welcome, %s
de_de: Willkommen, %s

source: Review and evaluate your assigned candidates for the Mobility Trailblazers Awards
de_de: Überprüfen und bewerten Sie Ihre zugewiesenen Kandidaten für die Mobility Trailblazers Awards

source: Back to Dashboard
de_de: Zurück zum Dashboard

source: Total Assigned
de_de: Gesamt zugewiesen

source: Completed
de_de: Abgeschlossen

source: In Draft
de_de: Im Entwurf

source: Pending
de_de: Ausstehend

source: Not Started
de_de: Nicht begonnen

source: Draft Saved
de_de: Entwurf gespeichert

source: View/Edit Evaluation
de_de: Ansehen

source: Continue Evaluation
de_de: Bewertung fortsetzen

source: Start Evaluation
de_de: Bewertung starten

source: No candidates have been assigned to you yet.
de_de: Ihnen wurden noch keine Kandidaten zugewiesen.

source: All Statuses
de_de: Alle Status

source: All Candidates
de_de: Alle Kandidaten

source: View All Candidates
de_de: Alle Kandidaten anzeigen

source: View Profile
de_de: Profil anzeigen

source: Evaluation Submitted
de_de: Bewertung eingereicht

source: Innovation Summary
de_de: Beschreibung

source: Description
de_de: Beschreibung

source: Biography
de_de: Biografie

source: Search candidates...
de_de: Kandidaten suchen...

source: No results found.
de_de: Keine Ergebnisse gefunden.

source: Invalid candidate ID.
de_de: Ungültige Kandidaten-ID.

source: Candidate not found.
de_de: Kandidat nicht gefunden.

source: Settings saved successfully!
de_de: Einstellungen erfolgreich gespeichert!

source: Assignments created successfully.
de_de: Zuweisungen erfolgreich erstellt.

source: Assign Selected
de_de: Ausgewählte zuweisen

source: Run Auto-Assignment
de_de: Automatische Zuweisung ausführen

source: Please select a bulk action
de_de: Bitte wählen Sie eine Massenaktion

source: Please select at least one assignment
de_de: Bitte wählen Sie mindestens eine Zuweisung aus

source: Please select a jury member
de_de: Bitte wählen Sie ein Jurymitglied aus

source: Apply
de_de: Anwenden

source: Export started. Download will begin shortly.
de_de: Export gestartet. Download beginnt in Kürze.

source: Mobility Trailblazers Settings
de_de: Mobility Trailblazers Einstellungen

source: General Settings
de_de: Allgemeine Einstellungen

source: Email Notifications
de_de: E-Mail-Benachrichtigungen

source: Enable email notifications
de_de: E-Mail-Benachrichtigungen aktivieren

source: Notification Email
de_de: Benachrichtigungs-E-Mail

source: Evaluation Settings
de_de: Bewertungseinstellungen

source: Allow jury members to save drafts
de_de: Jurymitgliedern erlauben, Entwürfe zu speichern

source: Allow jury members to edit submitted evaluations
de_de: Jurymitgliedern erlauben, eingereichte Bewertungen zu bearbeiten

source: Data Management
de_de: Datenverwaltung

source: Database Status
de_de: Datenbankstatus

source: All tables installed
de_de: Alle Tabellen installiert

source: Export Data
de_de: Daten exportieren

source: Import Data
de_de: Daten importieren

source: Export your data as CSV files for backup or analysis.
de_de: Exportieren Sie Ihre Daten als CSV-Dateien zur Sicherung oder Analyse.

source: Export Candidates
de_de: Kandidaten exportieren

source: Export Evaluations
de_de: Bewertungen exportieren

source: Export Assignments
de_de: Zuweisungen exportieren

source: Import Type
de_de: Importtyp

source: Select type...
de_de: Typ auswählen...

source: Candidates
de_de: Kandidaten

source: Jury Members
de_de: Jurymitglieder

source: CSV File
de_de: CSV-Datei

source: Select a CSV file to import. Maximum size: 10MB.
de_de: Wählen Sie eine CSV-Datei zum Importieren. Maximale Größe: 10MB.

source: Update existing records
de_de: Vorhandene Datensätze aktualisieren

source: If checked, existing records with matching IDs will be updated.
de_de: Wenn aktiviert, werden vorhandene Datensätze mit übereinstimmenden IDs aktualisiert.

source: Download Templates
de_de: Vorlagen herunterladen

source: Download these templates to see the required CSV format:
de_de: Laden Sie diese Vorlagen herunter, um das erforderliche CSV-Format zu sehen:

source: Candidates Template
de_de: Kandidaten-Vorlage

source: Jury Members Template
de_de: Jurymitglieder-Vorlage

source: Overview
de_de: Übersicht

source: Recent Activity
de_de: Letzte Aktivitäten

source: Quick Actions
de_de: Schnellaktionen

source: Add New Candidate
de_de: Neuen Kandidaten hinzufügen

source: Add New Jury Member
de_de: Neues Jurymitglied hinzufügen

source: View All Evaluations
de_de: Alle Bewertungen anzeigen

source: Manage Assignments
de_de: Zuweisungen verwalten

source: Database Tables
de_de: Datenbanktabellen

source: Active Users
de_de: Aktive Benutzer

source: Pending Tasks
de_de: Ausstehende Aufgaben

source: Assignment Management
de_de: Zuweisungsverwaltung

source: Auto-Assignment
de_de: Automatische Zuweisung

source: Manual Assignment
de_de: Manuelle Zuweisung

source: Assignment Method
de_de: Zuweisungsmethode

source: Random Distribution
de_de: Zufällige Verteilung

source: Sequential
de_de: Sequenziell

source: Balanced
de_de: Ausgeglichen

source: Candidates per Jury Member
de_de: Kandidaten pro Jurymitglied

source: Clear existing assignments
de_de: Vorhandene Zuweisungen löschen

source: Security check failed
de_de: Sicherheitsprüfung fehlgeschlagen

source: Permission denied
de_de: Zugriff verweigert

source: Are you sure you want to clear ALL assignments? This cannot be undone.
de_de: Sind Sie sicher, dass Sie ALLE Zuweisungen löschen möchten? Dies kann nicht rückgängig gemacht werden.

source: This will remove ALL jury assignments. Are you absolutely sure?
de_de: Dies wird ALLE Jury-Zuweisungen entfernen. Sind Sie absolut sicher?

source: Clearing...
de_de: Wird gelöscht...

source: Clear All
de_de: Alle löschen

source: All assignments have been cleared.
de_de: Alle Zuweisungen wurden gelöscht.

source: Security configuration error. Please refresh the page and try again.
de_de: Sicherheitskonfigurationsfehler. Bitte aktualisieren Sie die Seite und versuchen Sie es erneut.

source: Request timed out. Please check your connection and try again.
de_de: Anfrage-Zeitüberschreitung. Bitte überprüfen Sie Ihre Verbindung und versuchen Sie es erneut.

source: Request was cancelled.
de_de: Anfrage wurde abgebrochen.

source: You do not have permission to perform this action.
de_de: Sie haben keine Berechtigung, diese Aktion auszuführen.

source: The requested resource was not found.
de_de: Die angeforderte Ressource wurde nicht gefunden.

source: Server error. Please try again later.
de_de: Serverfehler. Bitte versuchen Sie es später erneut.

source: Network error. Please try again.
de_de: Netzwerkfehler. Bitte versuchen Sie es erneut.

source: Please ensure all scores are between 0 and 10.
de_de: Bitte stellen Sie sicher, dass alle Bewertungen zwischen 0 und 10 liegen.

source: You are not assigned to evaluate this candidate.
de_de: Sie sind nicht zur Bewertung dieses Kandidaten zugewiesen.

source: Error saving evaluation
de_de: Fehler beim Speichern der Bewertung

source: Mobility Trailblazers Language Settings
de_de: Mobility Trailblazers Spracheinstellungen

source: Preferred Language
de_de: Bevorzugte Sprache

source: Select your preferred language for the Mobility Trailblazers platform.
de_de: Wählen Sie Ihre bevorzugte Sprache für die Mobility Trailblazers-Plattform.

source: Language Settings
de_de: Spracheinstellungen

source: Default Language
de_de: Standardsprache

source: Select the default language for the platform.
de_de: Wählen Sie die Standardsprache für die Plattform.

source: Enable Language Switcher
de_de: Sprachumschalter aktivieren

source: Show language switcher in the frontend.
de_de: Sprachumschalter im Frontend anzeigen.

source: Auto-detect Language
de_de: Sprache automatisch erkennen

source: Automatically detect user language based on browser settings.
de_de: Benutzersprache automatisch basierend auf Browsereinstellungen erkennen.

source: Invalid language selection.
de_de: Ungültige Sprachauswahl.

source: Language updated successfully.
de_de: Sprache erfolgreich aktualisiert.

source: Please provide any additional insights or observations about this candidate (optional).
de_de: Bitte geben Sie zusätzliche Einblicke oder Beobachtungen zu diesem Kandidaten an (optional).

source: Who can see these comments?
de_de: Wer kann diese Kommentare sehen?

source: Your comments are confidential and will only be viewed by the Mobility Trailblazers Award organizers to support the final decision.
de_de: Ihre Kommentare sind vertraulich und werden nur von den Organisatoren des Mobility Trailblazers Awards eingesehen, um die finale Entscheidung zu unterstützen.

source: Why should you leave comments?
de_de: Warum sollten Sie Kommentare hinterlassen?

source: Your qualitative insights help us get a more complete picture of the candidate beyond the numerical ratings. Please share special strengths, innovative approaches, or other relevant observations (optional).
de_de: Ihre qualitativen Einblicke helfen uns, über die numerischen Bewertungen hinaus ein vollständigeres Bild des Kandidaten zu erhalten. Bitte teilen Sie besondere Stärken, innovative Ansätze oder andere relevante Beobachtungen mit (optional).

source: Submitting...
de_de: Wird eingereicht...

source: Thank you for submitting your evaluation!
de_de: Vielen Dank für die Einreichung Ihrer Bewertung!

source: This evaluation has been submitted. You can still edit and resubmit.
de_de: Diese Bewertung wurde eingereicht. Sie können sie immer noch bearbeiten und erneut einreichen.

source: Loading evaluation form...
de_de: Bewertungsformular wird geladen...

source: Draft
de_de: Entwurf

source: You must be logged in as a jury member to access this dashboard.
de_de: Sie müssen als Jurymitglied angemeldet sein, um auf dieses Dashboard zugreifen zu können.

source: Your jury member profile could not be found.
de_de: Ihr Jurymitglied-Profil konnte nicht gefunden werden.

source: Are you sure you want to change the default language? This will affect all users who haven't set a preference.
de_de: Sind Sie sicher, dass Sie die Standardsprache ändern möchten? Dies wirkt sich auf alle Benutzer aus, die keine Präferenz festgelegt haben.

source: Language preference updated successfully.
de_de: Sprachpräferenz erfolgreich aktualisiert.

source: English
de_de: Englisch

source: German
de_de: Deutsch

source: Security check failed. Please refresh the page and try again.
de_de: Sicherheitsprüfung fehlgeschlagen. Bitte aktualisieren Sie die Seite und versuchen Sie es erneut.

source: You must be logged in to test AJAX
de_de: Sie müssen angemeldet sein, um AJAX zu testen

source: You must be an administrator to access debug information
de_de: Sie müssen Administrator sein, um auf Debug-Informationen zuzugreifen

source: File upload failed. Please try again.
de_de: Datei-Upload fehlgeschlagen. Bitte versuchen Sie es erneut.

source: File too large. Maximum size is %s.
de_de: Datei zu groß. Maximale Größe ist %s.

source: Invalid file type. Allowed types: %s
de_de: Ungültiger Dateityp. Erlaubte Typen: %s

source: Invalid file type. Only CSV files are allowed.
de_de: Ungültiger Dateityp. Nur CSV-Dateien sind erlaubt.

source: File contains prohibited content.
de_de: Datei enthält verbotene Inhalte.

source: File not found or not readable
de_de: Datei nicht gefunden oder nicht lesbar

source: File size exceeds maximum of %s
de_de: Dateigröße überschreitet Maximum von %s

source: Could not open CSV file
de_de: CSV-Datei konnte nicht geöffnet werden

source: CSV file appears to be empty
de_de: CSV-Datei scheint leer zu sein

source: Column count mismatch
de_de: Spaltenanzahl stimmt nicht überein

source: Failed to parse row
de_de: Zeile konnte nicht analysiert werden

source: Invalid import type: %s
de_de: Ungültiger Importtyp: %s

source: Missing required field: %s
de_de: Erforderliches Feld fehlt: %s

source: Invalid email address
de_de: Ungültige E-Mail-Adresse

source: Import aborted by user
de_de: Import vom Benutzer abgebrochen

source: Processing batch %d of %d...
de_de: Verarbeite Stapel %d von %d...

source: Importing
de_de: Importieren

source: import_in_progress
de_de: Import läuft

source: please_wait
de_de: Bitte warten

source: Imported
de_de: Importiert

source: Updated
de_de: Aktualisiert

source: Skipped
de_de: Übersprungen

source: Errors
de_de: Fehler

source: records
de_de: Datensätze

source: Orphaned assignments cleaned
de_de: Verwaiste Zuweisungen bereinigt

source: Database integrity verified
de_de: Datenbankintegrität überprüft

source: Missing data fixed
de_de: Fehlende Daten behoben

source: Widget updated
de_de: Widget aktualisiert

source: Refresh failed
de_de: Aktualisierung fehlgeschlagen

source: Loading
de_de: Lädt

source: Processing
de_de: Verarbeitung

source: Please wait
de_de: Bitte warten

source: Confirm
de_de: Bestätigen

source: Are you sure?
de_de: Sind Sie sicher?

source: Excel files (.xlsx) are not supported. Please save your file as CSV format: In Excel, go to File → Save As → Choose "CSV (Comma delimited)" as the file type.
de_de: Excel-Dateien (.xlsx) werden nicht unterstützt. Bitte speichern Sie Ihre Datei im CSV-Format: Gehen Sie in Excel zu Datei → Speichern unter → Wählen Sie "CSV (Trennzeichen-getrennt)" als Dateityp.

source: Changes saved successfully
de_de: Änderungen erfolgreich gespeichert

source: Operation completed successfully
de_de: Vorgang erfolgreich abgeschlossen

source: An unexpected error occurred. Please try again.
de_de: Ein unerwarteter Fehler ist aufgetreten. Bitte versuchen Sie es erneut.

source: No changes detected
de_de: Keine Änderungen erkannt

source: Settings updated
de_de: Einstellungen aktualisiert

source: Jury Member Progress
de_de: Jurymitglied-Fortschritt

source: %d pending
de_de: %d ausstehend

source: Today
de_de: Heute

source: Yesterday
de_de: Gestern

source: %d days ago
de_de: vor %d Tagen

source: Never
de_de: Nie

source: Send Reminder
de_de: Erinnerung senden

source: Send Reminders to Incomplete
de_de: Erinnerungen an Unvollständige senden

source: Remind About Drafts
de_de: An Entwürfe erinnern

source: Export Coaching Report
de_de: Coaching-Bericht exportieren

source: Refresh Statistics
de_de: Statistiken aktualisieren

source: Recent Evaluation Activity
de_de: Letzte Bewertungsaktivität

source: Time
de_de: Zeit

source: No recent activity
de_de: Keine aktuellen Aktivitäten

source: Completion Rate
de_de: Abschlussrate

source: Send reminder emails to all jury members with incomplete evaluations?
de_de: Erinnerungs-E-Mails an alle Jurymitglieder mit unvollständigen Bewertungen senden?

source: Sending reminders...
de_de: Sende Erinnerungen...

source: Reminders sent successfully
de_de: Erinnerungen erfolgreich gesendet

source: Report exported successfully
de_de: Bericht erfolgreich exportiert

source: %d reminder emails sent
de_de: %d Erinnerungs-E-Mails gesendet

source: Reminder: Mobility Trailblazers Evaluations Pending
de_de: Erinnerung: Mobility Trailblazers Bewertungen ausstehend

source: Dear %s, You have %d pending evaluations for the Mobility Trailblazers Awards. Please log in to complete your evaluations: %s Thank you for your participation. Best regards, Mobility Trailblazers Team
de_de: Sehr geehrte(r) %s, Sie haben %d ausstehende Bewertungen für die Mobility Trailblazers Awards. Bitte melden Sie sich an, um Ihre Bewertungen abzuschließen: %s Vielen Dank für Ihre Teilnahme. Mit freundlichen Grüßen, Mobility Trailblazers Team

source: No jury members found
de_de: Keine Jurymitglieder gefunden

source: Performance Testing Suite
de_de: Performance-Testsuite

source: Large Import Test
de_de: Großer Import-Test

source: Large Export Test
de_de: Großer Export-Test

source: Evaluation Query Test
de_de: Bewertungsabfrage-Test

source: Memory Usage Test
de_de: Speichernutzungs-Test

source: Assignment Distribution Test
de_de: Zuweisungsverteilungs-Test

source: Test Large Import (100 records)
de_de: Großen Import testen (100 Datensätze)

source: Test Large Export
de_de: Großen Export testen

source: Test Database Queries
de_de: Datenbankabfragen testen

source: Test Memory Usage
de_de: Speichernutzung testen

source: Test Assignment Distribution
de_de: Zuweisungsverteilung testen

source: Test Index Performance
de_de: Index-Performance testen

source: Run All Tests
de_de: Alle Tests ausführen

source: Test Results:
de_de: Testergebnisse:

source: Tests completed successfully!
de_de: Tests erfolgreich abgeschlossen!

source: Duration:
de_de: Dauer:

source: Memory Used:
de_de: Genutzter Speicher:

source: candidates_processed
de_de: Kandidaten verarbeitet

source: candidates_exported
de_de: Kandidaten exportiert

source: query_time
de_de: Abfragezeit

source: distribution_quality
de_de: Verteilungsqualität

source: Excellent
de_de: Ausgezeichnet

source: Good
de_de: Gut

source: Fair
de_de: Befriedigend

source: Poor
de_de: Schlecht

source: No assignments to balance
de_de: Keine Zuweisungen zum Ausgleichen

source: %d assignments rebalanced across %d jury members
de_de: %d Zuweisungen wurden auf %d Jurymitglieder neu verteilt

source: assignment_distribution_validated
de_de: Zuweisungsverteilung validiert

source: assignments_rebalanced
de_de: Zuweisungen neu verteilt

source: average_per_jury
de_de: Durchschnitt pro Jurymitglied

source: standard_deviation
de_de: Standardabweichung

source: min_assignments
de_de: Minimale Zuweisungen

source: max_assignments
de_de: Maximale Zuweisungen

source: jury_count
de_de: Anzahl Jurymitglieder

source: total_assignments
de_de: Gesamtzuweisungen

source: Validate Distribution
de_de: Verteilung validieren

source: Rebalance Assignments
de_de: Zuweisungen neu verteilen

source: Distribution Statistics
de_de: Verteilungsstatistiken

source: Quality:
de_de: Qualität:

source: Average:
de_de: Durchschnitt:

source: Standard Deviation:
de_de: Standardabweichung:

source: Search by name, organization or position...
de_de: Suche nach Name, Organisation oder Position...

source: All
de_de: Alle

source: Website
de_de: Webseite

source: LinkedIn Profile
de_de: LinkedIn-Profil

source: Error loading content
de_de: Fehler beim Laden des Inhalts

source: Error saving content
de_de: Fehler beim Speichern des Inhalts

source: You have unsaved changes. Are you sure you want to close?
de_de: Sie haben ungespeicherte Änderungen. Sind Sie sicher, dass Sie schließen möchten?

source: No candidates found
de_de: Keine Kandidaten gefunden

source: Innovation Level
de_de: Innovationsgrad

source: Previous Candidate
de_de: Vorheriger Kandidat

source: Next Candidate
de_de: Nächster Kandidat

source: Quick Facts
de_de: Schnellübersicht

source: Organization:
de_de: Organisation:

source: Category:
de_de: Kategorie:

source: Jury Action
de_de: Jury-Aktion

source: Share
de_de: Teilen

source: Assigned Candidates
de_de: Zugewiesene Kandidaten

source: Submitted Evaluations
de_de: Eingereichte Bewertungen

source: Drafts
de_de: Entwürfe

source: Average Score
de_de: Durchschnittliche Bewertung

source: Average Score:
de_de: Durchschnittliche Bewertung:

source: criteria evaluated
de_de: Kriterien bewertet

source: About Me
de_de: Über mich

source: Debug Information
de_de: Debug-Informationen

source: Assignment Distribution Analysis
de_de: Zuweisungsverteilungsanalyse

source: Top Ranked Candidates
de_de: Rangliste der bewerteten Kandidaten

source: Your Rankings
de_de: Ihre Rangliste

source: Real-time ranking based on evaluation scores
de_de: Sie können die Werte direkt in der Rangliste ändern.

source: Rank
de_de: Rang

source: Candidate
de_de: Kandidat/in

source: Actions
de_de: Änderungen

source: Full View
de_de: Details anzeigen

source: No rankings available yet.
de_de: Noch keine Rankings verfügbar.

source: Error loading candidate information.
de_de: Fehler beim Laden der Kandidateninformationen.

source: Send reminder to %s?
de_de: Erinnerung an %s senden?

source: Reminder Sent
de_de: Erinnerung gesendet

source: Dear %s,
de_de: Sehr geehrte/r %s,

source: This is a friendly reminder about your pending evaluations for the Mobility Trailblazers awards.
de_de: Dies ist eine freundliche Erinnerung an Ihre ausstehenden Bewertungen für die Mobility Trailblazers Awards.

source: You have %d candidate(s) awaiting your evaluation.
de_de: Sie haben %d Kandidat(en), die auf Ihre Bewertung warten.

source: Deadline:
de_de: Frist:

source: Your expertise and insights are invaluable in recognizing the innovators shaping the future of mobility in the DACH region.
de_de: Ihre Expertise und Einblicke sind unverzichtbar für die Anerkennung der Innovatoren, die die Zukunft der Mobilität in der DACH-Region gestalten.

source: Complete Your Evaluations
de_de: Bewertungen abschließen
