Repository: nicolasestrem/mobility-trailblazers
Catalog: languages/mobility-trailblazers-*.po
Languages: de_de

source: Thank you for your continued dedication to this important initiative.
de_de: Vielen Dank für Ihr kontinuierliches Engagement für diese wichtige Initiative.

source: Best regards,
de_de: Mit freundlichen Grüßen,

source: The Mobility Trailblazers Team
de_de: Das Mobility Trailblazers Team

source: This is an automated reminder from the Mobility Trailblazers evaluation platform.
de_de: Dies ist eine automatische Erinnerung von der Mobility Trailblazers Bewertungsplattform.

source: If you have any questions, please contact us at %s
de_de: Bei Fragen kontaktieren Sie uns bitte unter %s

source: New Candidate Assignments
de_de: Neue Kandidatenzuweisungen

source: You have been assigned %d new candidate(s) to evaluate for the Mobility Trailblazers awards.
de_de: Ihnen wurden %d neue Kandidat(en) zur Bewertung für die Mobility Trailblazers Awards zugewiesen.

source: Your Assigned Candidates:
de_de: Ihre zugewiesenen Kandidaten:

source: Please review each candidate thoroughly and provide your evaluation based on the following criteria:
de_de: Bitte prüfen Sie jeden Kandidaten gründlich und geben Sie Ihre Bewertung basierend auf den folgenden Kriterien ab:

source: Start Evaluating
de_de: Bewertung starten

source: Your expertise is crucial in identifying the mobility innovators who are making a real difference.
de_de: Ihre Expertise ist entscheidend für die Identifizierung der Mobilitätsinnovatoren, die einen echten Unterschied machen.

source: This notification was sent from the Mobility Trailblazers evaluation platform.
de_de: Diese Benachrichtigung wurde von der Mobility Trailblazers Bewertungsplattform gesendet.

source: [Mobility Trailblazers] Reminder: %d Evaluations Pending
de_de: [Mobility Trailblazers] Erinnerung: %d ausstehende Bewertungen

source: [Mobility Trailblazers] %d New Candidate Assignment(s)
de_de: [Mobility Trailblazers] %d neue Kandidatenzuweisung(en)

source: Failed to send reminder to user ID %d
de_de: Erinnerung an Benutzer-ID %d konnte nicht gesendet werden

source: Evaluation Count
de_de: Anzahl Bewertungen

source: Courage Score
de_de: Mut & Pioniergeist Bewertung

source: Innovation Score
de_de: Innovationsgrad Bewertung

source: Implementation Score
de_de: Umsetzungskraft & Wirkung Bewertung

source: Relevance Score
de_de: Relevanz Bewertung

source: Visibility Score
de_de: Vorbildfunktion & Sichtbarkeit Bewertung

source: Date
de_de: Datum

source: Country
de_de: Land

source: Article
de_de: Artikel

source: Evaluation Overview
de_de: Bewertungsübersicht

source: Total Evaluations
de_de: Gesamtanzahl Bewertungen

source: In Progress
de_de: In Bearbeitung

source: Jury Member Activity
de_de: Jurymitglied Aktivität

source: Assigned
de_de: Zugewiesen

source: Progress
de_de: Fortschritt

source: No jury member data available.
de_de: Keine Jurymitglied-Daten verfügbar.

source: Error
de_de: Fehler

source: An error occurred
de_de: Ein Fehler ist aufgetreten

source: Please select a jury member and at least one candidate.
de_de: Bitte wählen Sie ein Jurymitglied und mindestens einen Kandidaten aus.

source: Assignment removed successfully.
de_de: Zuweisung erfolgreich entfernt.

source: Network error. Please check your connection and try again.
de_de: Netzwerkfehler. Bitte überprüfen Sie Ihre Verbindung und versuchen Sie es erneut.

source: Yes
de_de: Ja

source: No
de_de: Nein

source: Choose Header Background Image
de_de: Header-Hintergrundbild auswählen

source: Use this image
de_de: Dieses Bild verwenden

source: Remove Image
de_de: Bild entfernen

source: Preview Animation
de_de: Animation vorschauen

source: Please enter valid weights between 0 and 10
de_de: Bitte geben Sie gültige Gewichtungen zwischen 0 und 10 ein

source: WARNING: You have enabled data deletion on uninstall. This will permanently delete all plugin data when the plugin is removed. Are you sure?
de_de: WARNUNG: Sie haben die Datenlöschung bei der Deinstallation aktiviert. Dies wird alle Plugin-Daten dauerhaft löschen, wenn das Plugin entfernt wird. Sind Sie sicher?

source: Normal Text
de_de: Normaler Text

source: Heading 1
de_de: Überschrift 1

source: Heading 2
de_de: Überschrift 2

source: Heading 3
de_de: Überschrift 3

source: Enter URL:
de_de: URL eingeben:

source: Bold
de_de: Fett

source: Italic
de_de: Kursiv

source: Underline
de_de: Unterstrichen

source: Strikethrough
de_de: Durchgestrichen

source: Ordered List
de_de: Nummerierte Liste

source: Unordered List
de_de: Aufzählungsliste

source: Insert Link
de_de: Link einfügen

source: Remove Format
de_de: Formatierung entfernen

source: Undo
de_de: Rückgängig

source: Redo
de_de: Wiederholen

source: Headings
de_de: Überschriften

source: Press Ctrl+Enter to submit
de_de: Drücken Sie Strg+Enter zum Absenden

source: Evaluation Details
de_de: Bewertungsdetails

source: Close
de_de: Schließen

source: View Candidate
de_de: Kandidat anzeigen

source: Delete Evaluation
de_de: Bewertung löschen

source: Are you sure you want to delete this evaluation? This action cannot be undone.
de_de: Sind Sie sicher, dass Sie diese Bewertung löschen möchten? Diese Aktion kann nicht rückgängig gemacht werden.

source: Security token not found. Please refresh the page and try again.
de_de: Sicherheitstoken nicht gefunden. Bitte aktualisieren Sie die Seite und versuchen Sie es erneut.

source: Please select at least one evaluation to delete.
de_de: Bitte wählen Sie mindestens eine Bewertung zum Löschen aus.

source: Are you sure you want to delete %s evaluation(s)? This action cannot be undone.
de_de: Sind Sie sicher, dass Sie %s Bewertung(en) löschen möchten? Diese Aktion kann nicht rückgängig gemacht werden.

source: Note:
de_de: Hinweis:

source: Full evaluation details with individual criteria scores would normally appear here. This is a temporary fix while the full AJAX functionality is being restored.
de_de: Vollständige Bewertungsdetails mit einzelnen Kriterienbewertungen würden normalerweise hier angezeigt. Dies ist eine vorübergehende Lösung, während die vollständige AJAX-Funktionalität wiederhergestellt wird.

source: This will run a test distribution simulation. Continue?
de_de: Dies wird eine Test-Verteilungssimulation ausführen. Fortfahren?

source: Enter distribution method (balanced/random):
de_de: Verteilungsmethode eingeben (balanced/random):

source: Enter candidates per jury member:
de_de: Kandidaten pro Jurymitglied eingeben:

source: Distribution test seed:
de_de: Verteilungstest-Seed:

source: Check console for results after running auto-assignment.
de_de: Überprüfen Sie die Konsole auf Ergebnisse nach der automatischen Zuweisung.

source: This is a debug function. Continue?
de_de: Dies ist eine Debug-Funktion. Fortfahren?

source: AJAX Success:
de_de: AJAX-Erfolg:

source: AJAX Error:
de_de: AJAX-Fehler:

source: Demonstrates bold vision and willingness to take risks in advancing mobility transformation
de_de: Zeigt mutige Vision und Risikobereitschaft bei der Vorantreibung der Mobilitätstransformation

source: Shows creative problem-solving and introduces novel approaches to mobility challenges
de_de: Zeigt kreative Problemlösung und führt neuartige Ansätze für Mobilitätsherausforderungen ein

source: Successfully executes ideas with measurable impact on sustainable mobility
de_de: Setzt Ideen erfolgreich mit messbarer Wirkung auf nachhaltige Mobilität um

source: Addresses critical aspects of transportation transformation and future mobility needs
de_de: Behandelt kritische Aspekte der Verkehrswende und zukünftige Mobilitätsbedürfnisse

source: Serves as an inspiring example and actively promotes sustainable mobility solutions
de_de: Dient als inspirierendes Beispiel und fördert aktiv nachhaltige Mobilitätslösungen
